Revit 2027 API
BuiltInFailures.SketchFailures.ManyDirectionCurves Property
 More than one direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ManyDirectionCurves { get; }
Public Shared ReadOnly Property ManyDirectionCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ManyDirectionCurves {
	FailureDefinitionId^ get ();
}
static member ManyDirectionCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace